### Terraform Plan for Stage 🔍

<details>
<summary>Show Plan</summary>

```terraform
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.app.module.ssr_task.aws_ecs_task_definition.task[0] must be replaced
-/+ resource "aws_ecs_task_definition" "task" {
      ~ arn                      = "arn:aws:ecs:eu-west-1:339713113237:task-definition/digitalekanaler-designmanual:65" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-west-1:339713113237:task-definition/digitalekanaler-designmanual" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                    name             = "digitalekanaler-designmanual-main"
                  ~ secrets          = [
                        {
                            name      = "VITE_ENVIRONMENT"
                            valueFrom = "arn:aws:ssm:eu-west-1:339713113237:parameter/__digitalekanaler-designmanual__/env_vars/VITE_ENVIRONMENT"
                        },
                      - {
                          - name      = "VITE_PUBLIC_SANITY_STUDIO_URL"
                          - valueFrom = "arn:aws:ssm:eu-west-1:339713113237:parameter/__digitalekanaler-designmanual__/env_vars/VITE_PUBLIC_SANITY_STUDIO_URL"
                        },
                      - {
                          - name      = "VITE_SANITY_SECRET"
                          - valueFrom = "arn:aws:ssm:eu-west-1:339713113237:parameter/__digitalekanaler-designmanual__/env_vars/VITE_SANITY_SECRET"
                        },
                      - {
                          - name      = "VITE_SANITY_STUDIO_URL"
                          - valueFrom = "arn:aws:ssm:eu-west-1:339713113237:parameter/__digitalekanaler-designmanual__/env_vars/VITE_SANITY_STUDIO_URL"
                        },
                      - {
                          - name      = "VITE_SANITY_TOKEN"
                          - valueFrom = "arn:aws:ssm:eu-west-1:339713113237:parameter/__digitalekanaler-designmanual__/env_vars/VITE_SANITY_TOKEN"
                        },
                    ]
                    # (8 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "digitalekanaler-designmanual" -> (known after apply)
      ~ revision                 = 65 -> (known after apply)
      - tags                     = {} -> null
        # (13 unchanged attributes hidden)
    }

  # module.app.module.ssr_task.module.env_vars_to_ssm_parameters.data.aws_iam_policy_document.env_ssm_parameters_permissions will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "env_ssm_parameters_permissions" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ssm:DeleteParameter",
              + "ssm:DescribeParameters",
              + "ssm:GetParameter",
              + "ssm:GetParameters",
              + "ssm:GetParametersByPath",
              + "ssm:PutParameter",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ssm:eu-west-1:339713113237:parameter/__digitalekanaler-designmanual__/env_vars/VITE_ENVIRONMENT",
            ]
        }
    }

  # module.app.module.ssr_task.module.env_vars_to_ssm_parameters.aws_iam_role_policy.task_execution[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "task_execution" {
        id          = "digitalekanaler-designmanual-task-execution-role:digitalekanaler-designmanual-task-execution-ssm-parameters-policy"
        name        = "digitalekanaler-designmanual-task-execution-ssm-parameters-policy"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ssm:PutParameter",
                          - "ssm:GetParametersByPath",
                          - "ssm:GetParameters",
                          - "ssm:GetParameter",
                          - "ssm:DescribeParameters",
                          - "ssm:DeleteParameter",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ssm:eu-west-1:339713113237:parameter/__digitalekanaler-designmanual__/env_vars/VITE_SANITY_TOKEN",
                          - "arn:aws:ssm:eu-west-1:339713113237:parameter/__digitalekanaler-designmanual__/env_vars/VITE_SANITY_STUDIO_URL",
                          - "arn:aws:ssm:eu-west-1:339713113237:parameter/__digitalekanaler-designmanual__/env_vars/VITE_SANITY_SECRET",
                          - "arn:aws:ssm:eu-west-1:339713113237:parameter/__digitalekanaler-designmanual__/env_vars/VITE_PUBLIC_SANITY_STUDIO_URL",
                          - "arn:aws:ssm:eu-west-1:339713113237:parameter/__digitalekanaler-designmanual__/env_vars/VITE_ENVIRONMENT",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.app.module.ssr_task.module.env_vars_to_ssm_parameters.aws_ssm_parameter.environment_vars_to_ssm_parameters["VITE_PUBLIC_SANITY_STUDIO_URL"] will be destroyed
  # (because key ["VITE_PUBLIC_SANITY_STUDIO_URL"] is not in for_each map)
  - resource "aws_ssm_parameter" "environment_vars_to_ssm_parameters" {
      - arn             = "arn:aws:ssm:eu-west-1:339713113237:parameter/__digitalekanaler-designmanual__/env_vars/VITE_PUBLIC_SANITY_STUDIO_URL" -> null
      - data_type       = "text" -> null
      - id              = "/__digitalekanaler-designmanual__/env_vars/VITE_PUBLIC_SANITY_STUDIO_URL" -> null
      - name            = "/__digitalekanaler-designmanual__/env_vars/VITE_PUBLIC_SANITY_STUDIO_URL" -> null
      - region          = "eu-west-1" -> null
      - tags            = {} -> null
      - tags_all        = {
          - "application" = "digitalekanaler-designmanual"
          - "repo"        = "spor"
          - "terraform"   = "true"
        } -> null
      - tier            = "Standard" -> null
      - type            = "String" -> null
      - value           = (sensitive value) -> null
      - value_wo        = (write-only attribute) -> null
      - version         = 1 -> null
        # (3 unchanged attributes hidden)
    }

  # module.app.module.ssr_task.module.env_vars_to_ssm_parameters.aws_ssm_parameter.environment_vars_to_ssm_parameters["VITE_SANITY_SECRET"] will be destroyed
  # (because key ["VITE_SANITY_SECRET"] is not in for_each map)
  - resource "aws_ssm_parameter" "environment_vars_to_ssm_parameters" {
      - arn             = "arn:aws:ssm:eu-west-1:339713113237:parameter/__digitalekanaler-designmanual__/env_vars/VITE_SANITY_SECRET" -> null
      - data_type       = "text" -> null
      - id              = "/__digitalekanaler-designmanual__/env_vars/VITE_SANITY_SECRET" -> null
      - name            = "/__digitalekanaler-designmanual__/env_vars/VITE_SANITY_SECRET" -> null
      - region          = "eu-west-1" -> null
      - tags            = {} -> null
      - tags_all        = {
          - "application" = "digitalekanaler-designmanual"
          - "repo"        = "spor"
          - "terraform"   = "true"
        } -> null
      - tier            = "Standard" -> null
      - type            = "String" -> null
      - value           = (sensitive value) -> null
      - value_wo        = (write-only attribute) -> null
      - version         = 1 -> null
        # (3 unchanged attributes hidden)
    }

  # module.app.module.ssr_task.module.env_vars_to_ssm_parameters.aws_ssm_parameter.environment_vars_to_ssm_parameters["VITE_SANITY_STUDIO_URL"] will be destroyed
  # (because key ["VITE_SANITY_STUDIO_URL"] is not in for_each map)
  - resource "aws_ssm_parameter" "environment_vars_to_ssm_parameters" {
      - arn             = "arn:aws:ssm:eu-west-1:339713113237:parameter/__digitalekanaler-designmanual__/env_vars/VITE_SANITY_STUDIO_URL" -> null
      - data_type       = "text" -> null
      - id              = "/__digitalekanaler-designmanual__/env_vars/VITE_SANITY_STUDIO_URL" -> null
      - name            = "/__digitalekanaler-designmanual__/env_vars/VITE_SANITY_STUDIO_URL" -> null
      - region          = "eu-west-1" -> null
      - tags            = {} -> null
      - tags_all        = {
          - "application" = "digitalekanaler-designmanual"
          - "repo"        = "spor"
          - "terraform"   = "true"
        } -> null
      - tier            = "Standard" -> null
      - type            = "String" -> null
      - value           = (sensitive value) -> null
      - value_wo        = (write-only attribute) -> null
      - version         = 1 -> null
        # (3 unchanged attributes hidden)
    }

  # module.app.module.ssr_task.module.env_vars_to_ssm_parameters.aws_ssm_parameter.environment_vars_to_ssm_parameters["VITE_SANITY_TOKEN"] will be destroyed
  # (because key ["VITE_SANITY_TOKEN"] is not in for_each map)
  - resource "aws_ssm_parameter" "environment_vars_to_ssm_parameters" {
      - arn             = "arn:aws:ssm:eu-west-1:339713113237:parameter/__digitalekanaler-designmanual__/env_vars/VITE_SANITY_TOKEN" -> null
      - data_type       = "text" -> null
      - id              = "/__digitalekanaler-designmanual__/env_vars/VITE_SANITY_TOKEN" -> null
      - name            = "/__digitalekanaler-designmanual__/env_vars/VITE_SANITY_TOKEN" -> null
      - region          = "eu-west-1" -> null
      - tags            = {} -> null
      - tags_all        = {
          - "application" = "digitalekanaler-designmanual"
          - "repo"        = "spor"
          - "terraform"   = "true"
        } -> null
      - tier            = "Standard" -> null
      - type            = "String" -> null
      - value           = (sensitive value) -> null
      - value_wo        = (write-only attribute) -> null
      - version         = 1 -> null
        # (3 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 5 to destroy.

Warning: Redundant ignore_changes element

  on .terraform/modules/app.preview_url/main.tf line 111, in resource "aws_lambda_function" "lambda_function":
 111: resource "aws_lambda_function" "lambda_function" {

Adding an attribute name to ignore_changes tells Terraform to ignore future
changes to the argument in configuration after the object has been created,
retaining the value originally configured.

The attribute qualified_arn is decided by the provider alone and therefore
there can be no configured value to compare with. Including this attribute in
ignore_changes has no effect. Remove the attribute from ignore_changes to
quiet this warning.

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*For commit cf8f464556b2acd483274539971eb9cb951d6b51*
*Plan generated at: 2025-11-11 08:32:12 UTC*
